#ملخص مكتبة tkinter 
#اعداد ابن الحي > knk_1k

from tkinter import *

#####################
#حفظ النافذة داخل متغير 
root =Tk()
#####################

##############################################
#التحكم في حجم الشاشة بالنسبة للعرض والطول
root.geometry('450x450')
##############################################

###############################
#لاضافة اسم في عنوان النافذة 
root.title('برنامج تعليمي')
###############################

###################################
#دالة عمل الزر او البوتون
def in_butn():
    #استدعاء متغير الادخال 
    nam=ent.get()
    
    #####################
    #الجمل الشرطية 
    if(nam=='ali'):
        print('hi ali')
    else:
        pass
    #####################

    #للطباعة في موجه الاوامر
    print(nam)
    #للطباعة في البرنامج الخاص بي
    lib=Label(root,text=nam)
    #تعبئة النص بالعرض fill > X
    lib.pack(fill=X)
    #لتفريغ دالة الادخال بعد تفعيل الامر
    ent.delete(0,END)
###################################

####################################
#الاوفر
#دالة عند تاشير الموس على البوتون
def on_enter(e):
    butn ['background'] = 'white'
#عند تنحي الموس عن البوتون
def on_leave(e):
    butn ['background'] = 'green'
####################################

###############################
#انشاء بوتون او زر
butn=Button(root,
#اسم البوتون
text='BUTTON CKLEC',
#لون الزر
bg='green',
#لون النص
fg='red',
#لون خلفية الرز عند الظغط
activebackground='red',
#لون النص في الزر عند الظغط
activeforeground='white',
#عمل الزر في دالة 
command=in_butn)
#اظهار الزر
butn.pack()
###############################

###############################
#استدعاء الدالة الخاصة بالاوفر
butn.bind('<Enter>',on_enter)
butn.bind('<Leave>',on_leave)
###############################

#####################################
#لحفظ قيمة الادخال يجب انشاء متغير 
nam = StringVar() #قيمة نصية 
age = IntVar() #قيمة رقمية 
#####################################

###########################################
#pack() لظهور الدالة في المنتصف اسفل بعض
###########################################

###############################################
#grid(row=,column=) تعتمد على الصفوف والاعمدة
###############################################

##################################################
#place(x=13,y=43)لظهور الدالة بالنسبة لمحور x y
##################################################

#####################################
#حلقات التكرار 
def loop():
    for i in range(10):
        print(f'Hi Nubmer 2 >>{i}')
#####################################

###################
#انشاء حقل ادخال 
ent = Entry(root,
#متغير دالة الادخال
textvariable='nam')
ent.pack()
###################

#############################
#امر تشغيل الواجه الرسومية
root.mainloop()
#############################